{"pageProps":{"post":{"body":[{"_key":"eb199e5c3d79","_type":"block","children":[{"_key":"37d3eda827ca","_type":"span","marks":[],"text":"Why WordPress is a great CMS"}],"markDefs":[],"style":"h3"},{"_key":"144f2fb05edb","_type":"block","children":[{"_key":"948e2e6af0130","_type":"span","marks":[],"text":"I've worked with marketing teams who swear by WordPress. They swear by WordPress because when they are handed down some new content from the higher-ups, and with ease, they publish a stylish, SEO-friendly blog post."}],"markDefs":[],"style":"normal"},{"_key":"9abb7ebb25f2","_type":"block","children":[{"_key":"a2c0c8c3ea3d0","_type":"span","marks":[],"text":"And when they need to publish custom posts with a unique set of data, thanks to "},{"_key":"a2c0c8c3ea3d1","_type":"span","marks":["278726bfb98f"],"text":"Advanced Custom Fields"},{"_key":"a2c0c8c3ea3d2","_type":"span","marks":[],"text":", WordPress is easily extendable."}],"markDefs":[{"_key":"278726bfb98f","_type":"link","href":"https://www.advancedcustomfields.com/"}],"style":"normal"},{"_key":"66ba5a3b4e4a","_type":"block","children":[{"_key":"2607fc2e69250","_type":"span","marks":[],"text":"Yeah, WordPress is the swiss army knife of the internet."}],"markDefs":[],"style":"normal"},{"_key":"af11f209de4e","_type":"block","children":[{"_key":"14a3d3b27aa30","_type":"span","marks":[],"text":"WordPress provides everything a website manager needs to design, develop, and publish a website. When you start managing a website having everything you need in one system is excellent. However, you'll soon learn that WordPress is great at some things and poor at other things. From my experience, what WordPress is great at is managing dynamic types of content and what its not good at is create browser-optimized and highly performing web pages."}],"markDefs":[],"style":"normal"},{"_key":"5b5bf101cb0a","_type":"block","children":[{"_key":"062d3187d1cb0","_type":"span","marks":[],"text":"The good aspects - managing content"}],"markDefs":[],"style":"h3"},{"_key":"38b794f9d051","_type":"block","children":[{"_key":"e25ec15259780","_type":"span","marks":["strong"],"text":"WordPress is a great content management system"},{"_key":"e25ec15259781","_type":"span","marks":[],"text":", mainly because it's easy to get started, easy to use, and easy to customize. The website admin wins because, in addition to being easy to use, WordPress is also easy to develop. It's not hard for website admins to get in and build out customizable features. With plugins like Advanced Custom Fields, Custom Post Types, and the baked-in-to-WordPress Gutenburg editor, a website administrator can create a truly unique website."}],"markDefs":[],"style":"normal"},{"_key":"a06d7be6e4b9","_type":"block","children":[{"_key":"30860921707f0","_type":"span","marks":[],"text":"Just take a look at the "},{"_key":"30860921707f1","_type":"span","marks":["9d5b0da70ef7"],"text":"library of WordPress plugins"},{"_key":"30860921707f2","_type":"span","marks":[],"text":" available to the public (some are premium, but most of them are free). The possibilities are endless. You may be asking yourself, how come there are so many plugins out there? Well, that has to do with the philosophy behind the technology. WordPress is an "},{"_key":"30860921707f3","_type":"span","marks":["1d178b6e1454"],"text":"open source"},{"_key":"30860921707f4","_type":"span","marks":[],"text":" platform. And, open-source means that the codebase is open to the public. The result of this philosophy has propelled WordPress to the top website builder on the Internet."}],"markDefs":[{"_key":"9d5b0da70ef7","_type":"link","href":"https://wordpress.org/plugins/"},{"_key":"1d178b6e1454","_type":"link","href":"https://opensource.org/"}],"style":"normal"},{"_key":"56eb728b4f1f","_type":"block","children":[{"_key":"18a9ee0dfdb70","_type":"span","marks":[],"text":"At this point, WordPress is a monolithic piece of software that can continually grow based on you the user's needs. However, WordPress's size and scale is the very thing that makes it poor when it comes to browser performance."}],"markDefs":[],"style":"normal"},{"_key":"c1db627b455a","_type":"block","children":[{"_key":"a5f253adeea40","_type":"span","marks":[],"text":"The bad aspects - building webpages"}],"markDefs":[],"style":"h3"},{"_key":"303fdb20f02a","_type":"block","children":[{"_key":"91cda5237f6e0","_type":"span","marks":[],"text":"If you run a WordPress against Google's Lighthouse or GTMetrix, you'll most certainly get a failing grade. These analysis tools want to see minified HTML, modular CSS, and non-block JavaScript. Sadly, WordPress isn't designed for all that out of the box. Sure, there are plugins out there to try and solve this problem. But installing yet another program is going against what these website metrics want. They want simple, fully built webpages, and they want to interpret the page's meaning and index them. The browser wants simple, purely made pages, and you can't get pure by installing another plugin."}],"markDefs":[],"style":"normal"},{"_key":"751bda29d4a1","_type":"block","children":[{"_key":"de548f1387f90","_type":"span","marks":[],"text":"So why doesn't WordPress have the ability to make simple HTML/CSS pages? That has to do with its architecture. WordPress pages are dynamic and built at the time the user requests them. To elaborate, when a user visits a blog page on a WordPress site, the user clicks the link to the page. Then the request is sent over the network. Once the request hits the server where the WordPress codebase is hosted, then another process is triggered. What happens now is WordPress maps together all the page's content together and then sends it back to the user. This process can happen in milliseconds, or sometimes this process can take several minutes. Often when this process is happening, the user is left staring at a page loader. It's this process that makes WordPress not great for making webpages."}],"markDefs":[],"style":"normal"},{"_key":"9b55dfef5117","_type":"block","children":[{"_key":"c86a7b1850c80","_type":"span","marks":[],"text":"How to use WordPress for what its good at"}],"markDefs":[],"style":"h3"},{"_key":"0f3d3309290d","_type":"block","children":[{"_key":"ac11300bee740","_type":"span","marks":[],"text":"So what should your business do if they are losing customers to a slow WordPress site? Well, it's simple, don't get rid of WordPress and use it only as your content management system. Then have a highly-trained front end web developer rebuild your site using the latest web technologies. You can host your WordPress site on a sub-domain and your site's front end on the main domain. You may ask yourself how something like this work can? The answer is APIs! That's an entirely different and deep subject, too much for this article. Here's a good article to read about "},{"_key":"ac11300bee741","_type":"span","marks":["dd0d94104da7"],"text":"why your company should be using APIs"},{"_key":"ac11300bee742","_type":"span","marks":[],"text":"."}],"markDefs":[{"_key":"dd0d94104da7","_type":"link","href":"https://tumultywebservices.dev/why-your-company-needs-an-api/"}],"style":"normal"},{"_key":"59a28be39b41","_type":"block","children":[{"_key":"1117bcbf480b0","_type":"span","marks":[],"text":"I'll leave you with a secret tip. You'll need a JAMstack developer to get all this done. The reason being, a JAMstack developer understands how to bring different technologies together using APIs to create a truly customizable and dynamic application. A JAMstack developer will build a static version of your website, using either Next.js or 11ty, and then build custom APIs to interface with your WordPress content. That way, Google and, by extension, your customers will like your fast website. And your content managers or website managers will appreciate the fact they don't need to learn a piece of software to manage the website. I think using this approach. You'll be able to utilize WordPress what it is good at and scratch what it isn't good at."}],"markDefs":[],"style":"normal"}],"date":"2020-12-15T05:00:00.000Z","description":"WordPress is the king of the web for a reason. It's a fantastic content management system. But, I'd never use it for building web pages.","image":"image-2fbe981497806fbfe14ea09b3dddc18e493311ad-225x225-png","slug":"use-wordpress-for-what-it-is-best-at","title":"Use WordPress For What It Is Best At"}},"__N_SSG":true}